{
  "posts": [
    {
      "id": 1,
      "title": "Starting My Journey as a Software Developer",
      "excerpt": "My first steps into the world of programming and what I've learned so far about building modern web applications.",
      "content": "Welcome to my first blog post! I'm excited to share my journey as I transition into software development. Starting with languages like Python and C++, I'm now expanding into web technologies...",
      "date": "2024-12-15",
      "category": "thoughts",
      "tags": ["career", "programming", "beginnings"],
      "readTime": "3 min read",
      "featured": true
    },
    {
      "id": 2,
      "title": "Building a Portfolio Website from Scratch",
      "excerpt": "A detailed guide on creating a modern portfolio website using HTML, CSS, and JavaScript with dynamic content loading.",
      "content": "In this tutorial, I'll walk you through the process of building a professional portfolio website. We'll cover everything from project structure to dynamic content loading using JSON...",
      "date": "2024-12-10",
      "category": "webdev",
      "tags": ["html", "css", "javascript", "portfolio"],
      "readTime": "8 min read",
      "featured": true
    },
    {
      "id": 3,
      "title": "Understanding CSS Grid vs Flexbox",
      "excerpt": "When to use CSS Grid and when to use Flexbox for modern web layouts. A practical comparison with examples.",
      "content": "CSS Grid and Flexbox are both powerful layout systems, but they serve different purposes. In this post, I'll explain when to use each one and provide practical examples...",
      "date": "2024-12-05",
      "category": "tutorial",
      "tags": ["css", "grid", "flexbox", "layout"],
      "readTime": "6 min read",
      "featured": false
    },
    {
      "id": 4,
      "title": "My Experience with Python vs C++",
      "excerpt": "Comparing two of my favorite programming languages and their use cases in different types of projects.",
      "content": "Having worked with both Python and C++, I want to share my thoughts on when to choose each language. Python's simplicity versus C++'s performance...",
      "date": "2024-11-28",
      "category": "programming",
      "tags": ["python", "cpp", "comparison", "languages"],
      "readTime": "5 min read",
      "featured": false
    }
  ]
}
